Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 07-Bow-Wow-and-Mew-Mew/CAT/corpus-genesis-ylt.en.utf8.tmx
Source language: en
Languages: chr

source: Chapter 14
chr: ᎠᏯᏙᎸᎢ 14

source: And it cometh to pass in the days of Amraphel king of Shinar, Arioch king of Ellasar, Chedorlaomer king of Elam, and Tidal king of Goyim,
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁ ᎾᎯᏳ ᏣᏁᎮ ᎠᎻᎴᏇᎵ ᎤᎬᏫᏳᎯ ᏌᎾ ᏚᏙᎥᎢ, ᎡᎵᏲᎩ ᎤᎬᏫᏳᎯ ᎡᎳᏌ ᏚᏙᎥᎢ, ᎩᏓᎴᎣᎹ ᎤᎬᏫᏳᎯ ᎢᎳᎻ ᏚᏙᎥᎢ, ᎠᎴ ᏔᏓᎵ ᎤᎬᏫᏳᎯ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᎤᎾᏤᎵᎦ;

source: they have made war with Bera king of Sodom, and with Birsha king of Gomorrah, Shinab king of Admah, and Shemeber king of Zeboim, and the king of Bela, which [is] Zoar.
chr: ᎾᏍᎩ ᎯᎠ ᏓᎿᏩ ᏄᏅᏁᎴ ᏈᎳ ᎤᎬᏫᏳᎯ ᏐᏓᎻ, ᎠᎴ ᏆᏌ ᎤᎬᏫᏳᎯ ᎪᎹᎵ, ᎠᎴ ᏏᎾᏈ ᎤᎬᏫᏳᎯ ᎠᏓᎹ, ᎠᎴ ᏎᎻᏆ ᎤᎬᏫᏳᎯ ᏤᏉᎻ, ᎠᎴ ᎤᎬᏫᏳᎯ ᏈᎳ ᏚᏙᎥ ᎾᏍᎩ ᏐᏩ ᏥᎩ.

source: All these have been joined together unto the valley of Siddim, which [is] the Salt Sea;
chr: ᎾᏍᎩ ᎯᎠ ᏂᎦᏛ ᎤᎾᎵᎪᏁ ᏏᏗᎻᏱ ᎤᎨᏓᎵᏴᎢ, ᎾᏍᎩ ‾ᎠᎹ ᎥᏓᎸ ᏥᎩ.

source: twelve years they served Chedorlaomer, and the thirteenth year they rebelled.
chr: ᏔᎳᏚ ᏧᏕᏘᏴᏛ ᎩᏓᎴᎣᎹ ᏚᎾᏁᎶᏕᎢ, ᏦᎢᎦᏚᏏᏁᏃ ᎤᏕᏘᏴᏌᏗᏒ ᏚᏂᎦᏘᎸᏎᎢ.

source: And in the fourteenth year came Chedorlaomer, and the kings who [are] with him, and they smite the Rephaim in Ashteroth Karnaim, and the Zuzim in Ham, and the Emim in Shaveh Kiriathaim,
chr: ᏂᎦᏚᏏᏁᏃ ᎤᏕᏘᏴᏌᏗᏒ, ᎤᏂᎷᏤ ᎩᏓᎴᎣᎹ ᎠᎴ ᎾᏍᎩ ᎤᏂᎬᏫᏳᎯ ᏧᎾᎵᎪᏎᎢ, ᎠᎴ ᏚᏂᏎᎪᎩᏎ ᎠᏂᎵᏇ ᎾᎿ ᎠᏍᏘᎶᏗ-ᎧᎾᎻ ᏚᏙᎥᎢ, ᎠᎴ ᎠᏂᏑᏏ ᎾᎿ ᎭᎻ ᏚᏙᎥᎢ, ᎠᎴ ᎠᏂᎢᎻ ᎾᎿ ᏌᏈ-ᎩᎵᏯᏕᎻ ᎦᏙᎥᎢ,

source: and the Horites in their mount Seir, unto El-Paran, which [is] by the wilderness;
chr: ᎠᎴ ᎠᏂᎰᎳ ᎾᎿ ᎣᏓᎸ ᎤᎾᏤᎵ ᏏᎠ ᎦᏙᎥᎢ ᏫᎬᏍᏗ ᎡᎵ-ᏆᎳ, ᎾᏍᎩ ᎢᎾᎨ ᎾᎥ ᏥᎩ.

source: and they turn back and come in unto En-Mishpat, which [is] Kadesh, and smite the whole field of the Amalekite, and also the Amorite who is dwelling in Hazezon-Tamar.
chr: ᎢᎤᎾᏨᏎᏃ ᎠᎴ ᏗᏧᎪᏙᏗᏱ-ᎦᏄᎪᎬᎢ ᏗᎤᏂᎷᏤᎢ, ᎾᏍᎩ ᎨᏗᏏ ᏥᏚᏙᎥ, ᎠᎴ ᏚᏂᏎᎪᎩᏎ ᏂᎬᎾᏛ ᎠᏂᎠᎹᎴᎩ ᎤᎾᏤᎵᎪᎯ, ᎠᎴ ᎾᏍᏉ ᎠᏂᎡᎼᎵ ᎾᏍᎩ ᎭᏏᏐᎥᏓᎹ ᏣᏁᎮᎢ.

source: And the king of Sodom goeth out, and the king of Gomorrah, and the king of Admah, and the king of Zeboim, and the king of Bela, which [is] Zoar; and they set the battle in array with them in the valley of Siddim,
chr: ᎿᏉᏃ ᎤᏁᏅᏎ ᏐᏓᎻᏱ ᎤᎬᏫᏳᎯ, ᎠᎴ ᎪᎹᎵᏱ ᎤᎬᏫᏳᎯ, ᎠᎴ ᎠᏓᎹᏱ ᎤᎬᏫᏳᎯ, ᎠᎴ ᏤᏉᎻᏱ ᎤᎬᏫᏳᎯ, ᎠᎴ ᎤᎬᏫᏳᎯ ᏈᎳ ᏚᏙᎥᎢ, ᎾᏍᎩ ᏐᏩ ᏥᏚᏙᎥ; ᎾᎿᏃ ᏏᏗᎻ ᎤᎨᏓᎵᏴᎢ ᏚᎾᏟᏴᎮᎢ,

source: with Chedorlaomer king of Elam, and Tidal king of Goyim, and Amraphel king of Shinar, and Arioch king of Ellasar; four kings with the five.
chr: ᎾᏍᎩ ᎩᏓᎴᎣᎹ ᎤᎬᏫᏳᎯ ᎢᎳᎻ ᏚᎾᏟᏴᎮᎢ, ᎠᎴ ᏔᏓᎵ ᎤᎬᏫᏳᎯ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᎤᎾᏤᎵᎦ, ᎠᎴ ᎠᎻᎴᏇᎵ ᎤᎬᏫᏳᎯ ᏌᎾ ᏚᏙᎥᎢ, ᎠᎴ ᎡᎵᏲᎩ ᎤᎬᏫᏳᎯ ᎡᎳᏌ ᏚᏙᎥᎢ; ᏅᎩ ᎢᏯᏂᏛ ᎤᏂᎬᏫᏳᎯ ᎠᏂᏗᏢᏃ ᎯᏍᎩ.

source: And the valley of Siddim [is] full of bitumen-pits; and the kings of Sodom and Gomorrah flee, and fall there, and those left have fled to the mountain.
chr: ᎤᎨᏓᎵᏰᏃ ᏏᏗᎻ ᎤᎧᎵᏨᎯ ᎨᏎ ᏓᏔᎴᏒ ᏩᏥᎳᎨ ᎤᏂᎴᏍᏗᏱ; ᎤᏂᎬᏫᏳᎯᏃ ᏐᏓᎻ ᎠᎴ ᎪᎹᎵ ᎠᏁᎯ ᎤᎾᎵᏎᎢ, ᎠᎴ ᎾᎿ ᏚᏂᎸᏤᎢ; ᎤᎾᎵᏃᎯᏴᎯᏃ ᏦᏓᎸ ᏭᎾᎵᏍᏔᏁᎢ.

source: And they take the whole substance of Sodom and Gomorrah, and the whole of their food, and go away;
chr: ᎠᎴ ᏂᎦᏛ ᏧᎬᏩᎶᏗ ᏚᏂᏬᏅᎰᏁ ᏐᏓᎻᏱ ᎠᎴ ᎪᎹᎵᏱ, ᎠᎴ ᏂᎦᏛ ᎤᎾᎵᏍᏓᏴᏗ, ᎢᎤᏁᏅᏎᏃ.

source: and they take Lot, Abram's brother's son (seeing he is dwelling in Sodom), and his substance, and go away.
chr: ᎠᎴ ᎶᏗ ᎤᏂᏂᏴᎮᎢ, ᎾᏍᎩ ᎡᏆᎻ ᏗᎾᏓᏅᏟ ᎤᏪᏥ, ᎾᏍᎩ ᏐᏓᎻᏱ ᏤᎮᎢ, ᎠᎴ ᏧᎬᏩᎶᏗ ᎤᎲ ᎤᏂᎩᏎᎢ, ᎤᎾᏂᎩᏎᏃ.

source: And one who is escaping cometh and declareth to Abram the Hebrew, and he is dwelling among the oaks of Mamre the Amorite, brother of Eshcol, and brother of Aner, and they [are] Abram's allies.
chr: ᎠᏏᏴᏫᏃ ᎤᏓᏗᏫᏎᎸᎯ ᎤᎷᏤᎢ ᎠᎴ ᎤᏃᏁᎴ ᎡᏆᎻ ᎠᏈᎷ; ᎾᏍᎩᏰᏃ ᎠᏓᏯ-ᏕᏡᎬ ᎡᎥᎢ ᎹᎻᎵ ᎾᏍᎩ ᎡᎼᎵ ᏧᏤᎵᎦ, ᎾᏍᎩ ᎡᏍᎪᎵ ᎠᎴ ᎡᎾ ᎠᎾᎵᏅᏟ ᏥᎨᏎᎢ; ᎾᏍᎩᏃ ᎯᎠ ᎤᎾᎵᎪᏎ ᎡᏆᎻ.

source: And Abram heareth that his brother hath been taken captive, and he draweth out his trained domestics, three hundred and eighteen, and pursueth unto Dan.
chr: ᎡᏆᎻᏃ ᎤᏛᎦᏅ ᎤᏫᏅ ᎠᏥᏴᎩᏅᎢ, ᎤᎾᎵᏍᎦᏍᏙᏗ ᏚᏁᎴ [ᏧᏅᏏᏓᏍᏗ] ᏧᏪᏲᏅᎯ, ᎦᏁᎸᏉ ᏧᎾᏛᏒᎯ, ᏦᎢᏧᏈ ᏁᎳᏚᏃ ᎢᏯᏂᏛ, ᎠᎴ ᏚᎨᎲᏎ ᏕᏂᏱ ᎢᏴᏛ.

source: And he divideth himself against them by night, he and his servants, and smiteth them, and pursueth them unto Hobah, which [is] at the left of Damascus;
chr: ᏔᎵᏃ ᏄᎾᏓᏕ ᎤᏩᏒ ᎠᎴ ᏧᏅᏏᏓᏍᏗ ᏒᏃᏱ ᎨᏒᎢ, ᎠᎴ ᏚᏂᏎᎪᎩᏎᎢ, ᎠᎴ ᏚᏂᎨᎥᏎ ᎰᏆ ᎢᏴᏛ, ᎾᏍᎩ ᏕᎹᏍᎦ ᎠᎦᏍᎦᏂ ᎢᏗᏢ ᏥᏫᏚᏳᎪᏗ.

source: and he bringeth back the whole of the substance, and also Lot his brother and his substance hath he brought back, and also the women and the people.
chr: ᎠᎴ ᎢᎤᏲᎸᏁ ᏂᎦᏛ ᏧᎬᏩᎶᏗ, ᎠᎴ ᎾᏍᏉ ᎶᏗ ᎤᏫᏅ ᎢᎤᏘᏃᎴᎢ, ᎠᎴ ᎾᏍᎩ ᎤᏤᎵ ᏧᎬᏩᎶᏗ, ᎠᎴ ᎾᏍᏉ ᎠᏂᎨᏴ, ᎠᎴ ᏴᏫ ᏚᏘᏃᎴᎢ.

source: And the king of Sodom goeth out to meet him (after his turning back from the smiting of Chedorlaomer, and of the kings who [are] with him), unto the valley of Shaveh, which [is] the king's valley.
chr: ᎤᎬᏫᏳᎯᏃ ᏐᏓᎻᏱ ᏚᏠᏒᏎ, ᏅᏛᎤᏨᏛ ᎾᏍᎩ ᏫᏚᎰᏅᎯ ᎩᏓᎴᎣᎹ ᏓᏘᏁᎲᎢ, ᎠᎴ ᎾᏍᎩ ᎤᏂᎬᏫᏳᎯ ᎤᏁᏙᎸᎯ, ᎾᎿ ᏌᏇ ᎤᎨᏓᎵᏴᎢ, ᎾᏍᎩ ᎤᎬᏫᏳᎯ ᎤᏤᎵ ᎤᎨᏓᎵᏴ ᏥᎩ.

source: And Melchizedek king of Salem hath brought out bread and wine, and he [is] priest of God Most High;
chr: ᎺᎵᎩᏌᏕᎩᏃ ᎤᎬᏫᏳᎯ ᏎᎳᎻᏱ ᎤᏲᎴ ᏭᏚ ᎠᎴ ᎩᎦᎨ ᎠᏗᏔᏍᏗ; [ᎺᎵᎩᏌᏕᎩᏃ] ᎠᏥᎸᎨᎶᎯ ᎨᏎᎢ, ᎤᏁᎳᏅᎯ ᏩᏍᏛ ᎦᎸᎳᏗ ᎡᎯ ᎤᏤᎵᎦ.

source: and he blesseth him, and saith, 'Blessed [is] Abram to God Most High, possessing heaven and earth;
chr: ᎠᎴ ᎣᏍᏛ ᎤᏁᏤᎴᎢ, ᎯᎠ ᏄᏪᏎᎢ, ᏩᏍᏛ ᎦᎸᎳᏗ ᎡᎯ ᎤᏁᎳᏅᎯ, ᎣᏍᏛ ᎢᏳᏛᏁᏗ ᎨᏎᏍᏗ ᎡᏆᎻ, ᎾᏍᎩ ᏧᏤᎵᎦ ᏥᎩ ᎦᎸᎶᎢ ᎠᎴ ᎡᎶᎯ.

source: and blessed [is] God Most High, who hath delivered thine adversaries into thy hand;' and he giveth to him a tenth of all.
chr: ᎠᎴ ᎦᎸᏉᏗᏳ ᎨᏎᏍᏗ ᎤᏁᎳᏅᎯ ᏩᏍᏛ ᎦᎸᎳᏗ ᎡᎯ ᎾᏍᎩ ᏥᏣᎵᏍᎪᎸᏓᏏ ᏘᏎᎪᎩᏍᏗᏱ ᎨᏣᏍᎦᎩ. ᎤᏁᎸᏁᏃ ᏂᎦᏛ ᏧᎬᏩᎶᏗ [ᎤᏓᏬᏅᏛ ᎠᏰᎲᎢ] ᎠᏍᎪᎯᏁ ᎪᏣᎴᏛ.

source: And the king of Sodom saith unto Abram, 'Give to me the persons, and the substance take to thyself,'
chr: ᎤᎬᏫᏳᎯᏃ ᏐᏓᎻᏱ ᎯᎠ ᏄᏪᏎᎴ ᎡᏆᎻ, ᏴᏫᏉ ᎠᏴ ᏗᏍᎩᏲᎯᏏ, ᏂᎯᏃ ᏧᎬᏩᎶᏗ ᎯᎩᏐᎾ.

source: and Abram saith unto the king of Sodom, 'I have lifted up my hand unto Jehovah, God Most High, possessing heaven and earth --
chr: ᎡᏆᎻᏃ ᎯᎠ ᏄᏪᏎᎴ ᎤᎬᏫᏳᎯ ᏐᏓᎻᏱ, ᏱᎰᏩ ᎤᏁᎳᏅᎯ ᏩᏍᏛ ᎦᎸᎳᏗ ᎡᎯ, ᎾᏍᎩ ᎤᏤᎵᎦ ᏥᎩ ᎦᎸᎶᎢ ᎠᎴ ᎡᎶᎯ, ᏥᏯᏎᎵᏓᏁᎸ,

source: from a thread even unto a shoe-latchet I take not of anything which thou hast, that thou say not, I -- I have made Abram rich;
chr: ᎾᏍᎩ ᎠᎩᎩᏍᏗᏱ ᏂᎨᏒᎾ ᎠᏍᏘᏉ, ᎠᎴ ᎠᎳᏑᎶ ᎪᎸᏌᏛᏗ, ᎠᎴ ᎪᎱᏍᏗ ᏣᏤᎵ ᎨᏒ ᎠᎩᎩᏍᏗᏱ ᏂᎨᏒᎾ, ᎯᎠᏰᏃ ᏱᏅᎯᏫ, ᎡᏆᎻ ᏥᏰᏅᎢᏍᏔᏅ;

source: save only that which the young men have eaten, and the portion of the men who have gone with me -- Aner, Eshcol, and Mamre -- they take their portion.'
chr: ᎯᎠᏍᎩᏂᏃᏅ ᎤᏩᏒ ᎾᏍᎩ ᎠᏂᏫᏅ ᎤᎾᎵᏍᏓᏴᏔᏅᎯ, ᎠᎴ ᎾᏍᎩ ᎾᏍᏉ ᎠᏂᏍᎦᏯ ᎣᎨᏅᏛ, ᎾᏍᎩ ᎡᎾ, ᎡᏍᎪᎵ, ᎠᎴ ᎹᎻᎵ; ᎾᏍᎩ ᏩᏂᎩ ᎤᏂᎩᏍᏗ ᎨᏒ ᎢᎦᎢ.

source: Chapter 15
chr: ᎠᏯᏙᎸᎢ 15

source: After these things hath the word of Jehovah been unto Abram in a vision, saying, 'Fear not, Abram, I [am] a shield to thee, thy reward [is] exceeding great.'
chr: ᎯᎠᏃ ᎾᏍᎩ ᏄᎵᏍᏔᏂᏙᎸ ᏱᎰᏩ ᎤᏁᏨᎯ ᎤᎷᏤᎴ ᎡᏆᎻ ᎤᏁᎳᏫᏎᎲᎢ, ᎯᎠ ᏂᎦᏪᏍᎨᎢ, ᏞᏍᏗ ᏱᎾᏰᏍᎨᏍᏗ ᎡᏆᎻ; ᎠᏴᏰᏃ ᏣᎬᏑᎶᏙᏗ ᎠᎴ ᎤᏣᏔᏅᎯ ᎡᏣᎫᏴᏓᏁᏗ ᏥᎩ.

source: And Abram saith, 'Lord Jehovah, what dost Thou give to me, and I am going childless? and an acquired son in my house is Demmesek Eliezer.'
chr: ᎡᏆᎻᏃ ᎯᎠ ᏄᏪᏎᎢ, ᏣᎬᏫᏳᎯ ᏣᏁᎳᏅᎯ, ᎦᏙ ᏓᏍᎩᏁᎵ, ᎬᏂᏳᏰᏃ ᎠᏇᏥ ᎥᏝ ᏰᎭ, ᎠᎴ ᎯᎠ ᎢᎵᎡᏌ ᏕᎹᏍᎦ ᎡᎯ ᎤᏤᎵ ᎢᏳᎵᏍᏙᏗ ᎢᎩ ᏥᏁᎸᎢ.

source: And Abram saith, 'Lo, to me Thou hast not given seed, and lo, a domestic doth heir me.'
chr: ᎡᏆᎻᏃ ᎯᎠ ᏄᏪᏎᎢ, ᎬᏂᏳᏉ ᎠᏴ ᎨᏒ ᎥᏝ ᎠᏇᏥ ᏱᏍᎩᎧᏁᎸ; ᎠᎴ ᎬᏂᏳᏉ ᏥᏁᎸ ᎤᏕᏅᎯ ᏓᏳᏘᏯᏍᏓᏁᎵ ᎠᎩᎾᎥᎢ.

source: And lo, the word of Jehovah [is] unto him, saying, 'This [one] doth not heir thee; but he who cometh out from thy bowels, he doth heir thee;'
chr: ᎠᎴ ᎬᏂᏳᏉ, ᏱᎰᏩ ᎤᏁᏨᎯ ᎤᎷᏤᎴ ᎡᏆᎻ, ᎯᎠ ᏂᎦᏪᏍᎨᎢ, ᎥᏝᏍᎩᏂ ᎯᎠ ᎾᏍᎩ ᎤᏘᏯᏍᏓᏁᏗ ᏱᎨᏎᏍᏗ ᏣᎾᎥᎢ; ᏨᎡᏍᎩᏂ ᎯᏰᎸ ᏅᏓᏳᏓᎴᏅᎯ ᎤᏘᏯᏍᏓᏁᏗ ᎨᏎᏍᏗ ᏣᎾᎥᎢ.

source: and He bringeth him out without, and saith, 'Look attentively, I pray thee, towards the heavens, and count the stars, if thou art able to count them;' and He saith to him, 'Thus is thy seed.'
chr: ᏙᏱᏃ ᏭᏘᏅᏍᏔᏁᎢ, ᎠᎴ ᎯᎠ ᏄᏪᏎᎢ, ᎦᎸᎳᏗ ᎢᏗᏢ ᏫᏔᎧᏅᎦ, ᎠᎴ ᏔᏎᎦ ᏃᏈᏏ, ᎢᏳᏃ ᏰᎵ ᏗᎨᏣᏎᎰᎲᏍᏗ ᎨᏎᏍᏗ; ᎯᎠᏃ ᏄᏪᏎᎴᎢ, ᎾᏍᎩᏯᏍᎩᏂ ᏄᏂᏧᏈᏍᏕᏍᏗ ᏣᏁᏢᏔᏅᎯ.

source: And he hath believed in Jehovah, and He reckoneth it to him -- righteousness.
chr: ᎡᏆᎻᏃ ᎤᏬᎯᏳᏁ ᏱᎰᏩ; ᎾᏍᎩᏃ ᏚᏳᎪᏛ ᏥᏄᏛᏁᎶ ᎤᏰᎸᎾᏁᎴᎢ.

source: And He saith unto him, 'I [am] Jehovah who brought thee out from Ur of the Chaldees, to give to thee this land to possess it;'
chr: ᎯᎠᏃ ᏄᏪᏎᎴᎢ, ᎠᏴ ᏱᎰᏩ ᎥᎵ ᎠᏂᎨᎳᏗ ᎤᎾᏤᎵᎪᎯ ᏅᏓᎬᏄᎪᏫᏒᎯ, ᎯᎠ ᎾᏍᎩ ᎦᏙᎯ ᎬᏁᏗᏱ ᏣᏤᎵᎦ ᎢᏳᎵᏍᏙᏗᏱ.

source: and he saith, 'Lord Jehovah, whereby do I know that I possess it?'
chr: ᎯᎠᏃ ᏄᏪᏎᎢ, ᏣᎬᏫᏳᎯ ᎠᏆᏤᎵ ᏱᎰᏩ, ᎦᏙ ᏓᎦᏙᎴᎣᎯᏍᏔᏂ ᎯᎠ ᎾᏍᎩ ᎠᏆᏤᎵᎦ ᎢᏳᎵᏍᏙᏗᏱ?

source: And He saith unto him, 'Take for Me a heifer of three years, and a she-goat of three years, and a ram of three years, and a turtle-dove, and a young bird;'
chr: ᎯᎠᏃ ᏄᏪᏎᎴᎢ; ᏫᏗᏍᎩᏯᏅᏏ ᏩᎦ ᎠᎩᏏ ᏦᎢ ᎢᏳᏕᏘᏴᏛ, ᎠᎴ ᎠᏫ ᎠᎭᏄᎸᎯ ᎠᎩᏏ ᏦᎢ ᎢᏳᏕᏘᏴᏛ, ᎠᎴ ᎤᏃᏕᏅ ᎠᏨᏯ ᏦᎢ ᎢᏳᏕᏘᏴᏛ, ᎠᎴ ᎫᎴ ᏗᏍᎪᏂᎯ, ᏬᏱᏃ ᎠᏛ.

source: and he taketh to him all these, and separateth them in the midst, and putteth each piece over against its fellow, but the bird he hath not divided;
chr: ᎯᎠᏃ ᎾᏍᎩ ᏂᎦᏛ ᏚᏘᏃᎮᎴᎢ, ᎠᎴ ᎠᏰᎵ ᏔᎵ ᏂᏚᏪᏕᎢ ᎠᎴ ᏧᎵᎬᎭᎷᏴᎯ ᏧᏦᏟᎭ ᏂᏚᏩᏁᎴᎢ; ᏥᏍᏆᏍᎩᏂ ᎥᏝ ᏱᏚᎬᎭᎷᏰᎢ.

source: and the ravenous birds come down upon the carcases, and Abram causeth them to turn back.
chr: ᎠᏂᏃᎯᎵᏙᎯᏃ ᎡᎳᏗ ᏄᎾᏛᏁᎸ ᎾᎿ ᎤᎾᎩᎸᏂᎸ, ᎡᏆᎻ ᏚᎨᎯᏙᎴᎢ.

source: And the sun is about to go in, and deep sleep hath fallen upon Abram, and lo, a terror of great darkness is falling upon him;
chr: ᎿᏉᏃ ᏅᏙ ᏭᏕᎵᎨᎢ ᎤᏣᏘ ᎠᏍᏓᏯ ᎤᎸᏁ ᎡᏆᎻ; ᎠᎴ ᎬᏂᏳᏉ ᎤᏣᏘ ᎤᏍᎦᏎᏗ ᎤᎵᏏᎩ ᎤᏭᏢᏂᎴᎢ.

source: and He saith to Abram, 'knowing -- know that thy seed is a sojourner in a land not theirs, and they have served them, and they have afflicted them four hundred years,
chr: ᎯᎠᏃ ᏄᏪᏎᎴ ᎡᏆᎻ, ᎤᏙᎯᏳᎯᏯ ᎯᎦᏔᎮᏍᏗ, ᎾᏍᎩ ᏂᎯ ᏣᏁᏢᏔᏅᎯ ᎠᏁᏙᎯ ᎨᏎᏍᏗ ᎾᎿ ᎦᏙᎯ ᎤᎾᏤᎵ ᏂᎨᏒᎾ, ᎠᎴ ᎾᎿ [ᎠᏁᎯ] ᏙᏓᎬᏩᏂᎾᏢᏂ; ᎠᎴ ᏅᎩᏧᏈ ᏧᏕᏘᏴᏛ ᏙᏓᎬᏩᏂᎩᎸᏂ.

source: and the nation also whom they serve I judge, and after this they go out with great substance;
chr: ᎠᎴ ᎾᏍᏉ ᎾᏍᎩ ᏴᏫ ᏥᏙᏓᎬᏩᏂᎾᏢᏂ, ᏙᏓᎦᏥᏳᎪᏓᏁᎵ; ᎣᏂᏃ ᎢᏴᏛ ᏛᏂᏄᎪᏥ ᎤᏣᏘ ᏧᎬᏩᎶᏗ ᎠᏂᏰᎮᏍᏗ.

source: and thou -- thou comest in unto thy fathers in peace; thou art buried in a good old age;
chr: ᏂᎯᏃ ᏅᏩᏙᎯᏯᏛ ᏗᏣᎦᏴᎵᎨ ᏗᏁᎲ ᏮᏘᎶᏏ; ᎠᎴ ᏣᎦᏴᎳᏥᏌᏛ ᎨᏎᏍᏗ ᎠᎴ ᏅᏩᏙᎯᏯᏛ ᏣᏓᏅᏖᏍᏗ ᏓᏰᏣᏂᏌᏂ.

source: and the fourth generation doth turn back hither, for the iniquity of the Amorite is not yet complete.'
chr: ᎠᏎᏃ ᏅᎩᏁ ᎤᎾᏓᏁᏟᏴᏛ ᎨᏎᏍᏗ ᏔᎵᏁ ᎠᏂ ᏛᎠᏂᎷᏥᎵ; ᎠᏂᎡᎼᎵᏰᏃ ᎠᏂᏍᎦᏅ ᎥᏝ ᎠᏏ ᎤᎧᎵᏨᎯ ᏱᎩ.

source: And it cometh to pass -- the sun hath gone in, and thick darkness hath been -- and lo, a furnace of smoke, and a lamp of fire, which hath passed over between those pieces.
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁ ᎿᏉ ᏅᏙ ᏭᏕᎵᏨ, ᎠᎴ ᎿᏉ ᎤᎵᏍᎨᎢ, ᎬᏂᏳᏉ ᏧᎦᏒᏍᏗ ᎥᏘ ᏗᎦᏚᏗᏱ, ᎠᎴ ᎠᏨᏍᏙᏗ ᎬᏨᏍᏗ ᎾᏍᎩ ᎤᎶᏎ ᎠᏰᎵ ᎾᎿ ᎠᎬᎭᎷᏴᎯ ᏓᎲᎢ.

source: In that day hath Jehovah made with Abram a covenant, saying, 'To thy seed I have given this land, from the river of Egypt unto the great river, the river Phrat,
chr: ᎾᎯᏳᏉᏃ ᎢᎦ ᏱᎰᏩ ᎧᏃᎮᏛ ᏚᏠᎯᏍᏓᏁᎴ ᎡᏆᎻ, ᎯᎠ ᏂᎦᏪᏍᎨᎢ, ᏂᎯ ᏣᏁᏢᏔᏅᎯ ᎦᏥᎥᏏ ᎯᎠ ᎦᏙᎯ, ᎢᏥᏈᏱ ᎡᏉᏂ ᎨᏴ ᏅᏓᏳᏓᎴᏅᏛ ᎤᏔᏅ ᎡᏉᏂ ᏂᎨᏴ ᏩᏍᏗ, ᎾᏍᎩ ᏳᏇᏗ ᎡᏉᏂ ᏥᎩ.

source: with the Kenite, and the Kenizzite, and the Kadmonite,
chr: ᎾᏍᎩ ᎠᏂᎨᏂ, ᎠᎴ ᎠᏂᎨᏂᏏ, ᎠᎴ ᎠᏂᎧᏗᎼᏂ,

source: and the Hittite, and the Perizzite, and the Rephaim,
chr: ᎠᎴ ᎠᏂᎯᏗ, ᎠᎴ ᎠᏂᏇᎵᏏ, ᎠᎴ ᎠᏂᎵᏇᎻ,

source: and the Amorite, and the Canaanite, and the Girgashite, and the Jebusite.'
chr: ᎠᎴ ᎠᏂᎡᎼᎵ, ᎠᎴ ᎠᏂᎨᎾᏂ, ᎠᎴ ᎠᏂᎦᎦᏏ, ᎠᎴ ᎠᏂᏤᏊᏏ (ᎤᎾᏤᎵᎪᎯ.)

source: Chapter 16
chr: ᎠᏯᏙᎸᎢ 16

source: And Sarai, Abram's wife, hath not borne to him, and she hath an handmaid, an Egyptian, and her name [is] Hagar;
chr: ᏎᎳᏱᏃ ᎡᏆᎻ ᎤᏓᎵᎢ, ᎥᏝ ᏗᏂᏲᎵ ᏱᏚᎾᏄᎪᏫᏎᎮᎢ; ᎤᏪᎧᎮᏃ ᎠᏛ ᎤᏅᏏᏓᏍᏗ ᎢᏥᏈᏱ ᎤᏕᏅᎯ ᎮᎦ ᏧᏙᎢᏛ.

source: and Sarai saith unto Abram, 'Lo, I pray thee, Jehovah hath restrained me from bearing, go in, I pray thee, unto my handmaid; perhaps I am built up from her;' and Abram hearkeneth to the voice of Sarai.
chr: ᏎᎳᏱᏃ ᎯᎠ ᏄᏪᏎᎴ ᎡᏆᎻ, ᎬᏂᏳᏉ, ᏱᎰᏩ ᎠᎩᎾᎯᏍᏓᏁᎸ ᏗᏆᎷᎸᏗᏱ; Ꭷ ᎭᏓᏳᎦ ᎠᏛ ᏥᏅᏏᏓᏍᏗ; ᎾᏍᎩᏃ ᏗᏂᏲᎵ ᏗᎬᎩᎾᏄᎪᏫᏎᏗ ᏱᏂᎦᎩ. ᎡᏆᎻᏃ ᎤᏛᏓᏍᏓᏁᎴ ᏎᎳᏱ ᎧᏁᎬᎢ.

source: And Sarai, Abram's wife, taketh Hagar the Egyptian, her handmaid, at the end of the tenth year of Abram's dwelling in the land of Canaan, and giveth her to Abram her husband, to him for a wife,
chr: ᏎᎳᏱᏃ ᎡᏆᎻ ᎤᏓᎵᎢ, ᏭᏯᏅᎮ ᎮᎦ ᎤᏅᏏᏓᏍᏗ ᎢᏥᏈᏱ ᎤᏕᏅᎯ, ᎾᏍᎩ ᎡᏆᎻ ᎠᏍᎪᎯ ᏧᏕᏗᏴᏛ ᎬᏩᏕᏂᎸᎯ ᏂᎨᏎ ᎨᎾᏂ ᎦᏙᎯ, ᎠᎴ ᎾᏍᎩ ᎤᏰᎯ ᎡᏆᎻ ᎤᏪᎧᏁᎴ ᎤᏓᏴᏍᏗ.

source: and he goeth in unto Hagar, and she conceiveth, and she seeth that she hath conceived, and her mistress is lightly esteemed in her eyes.
chr: ᎤᏓᏴᏎᏃ ᎮᎦ, ᎠᎴ ᎤᏁᎵᏤ ᎮᎦ; ᎮᎦᏃ ᎤᏙᎴᎰᏒ ᎤᏁᎵᏨ ᎤᎾᏝᎢ ᎦᏂᏆᏘᎯ ᏄᎵᏍᏔᏁᎢ.

source: And Sarai saith unto Abram, 'My violence [is] for thee; I -- I have given mine handmaid into thy bosom, and she seeth that she hath conceived, and I am lightly esteemed in her eyes; Jehovah doth judge between me and thee.'
chr: ᏎᎳᏱᏃ ᎯᎠ ᏄᏪᏎᎴ ᎡᏆᎻ, ᏂᏚᏳᎪᏛᎾ ᎾᏆᏛᏁᎸ ᏂᎯ ᏅᏂᏌ; ᏥᏅᏏᏓᏍᏗ ᎬᏴᎧᏁᎸ ᏣᏓᏰᏍᏗ; ᎦᏁᎵᏒᏃ ᎤᏙᎴᎰᏒ, ᎿᏉ ᎠᎩᏂᏆᏘᎯ ᏄᎵᏍᏔᏅᎩ; ᏱᎰᏩ ᎠᏗᎾ ᎠᏴ ᏂᎯᏃ ᏫᏗᎩᏄᎪᏓᏏ.

source: And Abram saith unto Sarai, 'Lo, thine handmaid [is] in thine hand, do to her that which is good in thine eyes;' and Sarai afflicted her, and she fleeth from her presence.
chr: ᎠᏎᏃ ᎡᏆᎻ ᎯᎠ ᏄᏪᏎᎴ ᏎᎳᏱ, ᎬᏂᏳᏉ ᏣᏒᎦᎸ ᏣᏚᎵᏍᎬ ᎢᎯᏴᏁᏗᏱ; ᎭᏓᏅᏖᏍᎬᏉ ᏂᏴᎦ. ᎿᏉᏃ ᏎᎳᏱ ᎬᏍᎦᎢᏍᏓᎩ ᏄᏩᏁᎸ ᎤᎵᏘᎡᎴᎢ.

source: And a messenger of Jehovah findeth her by the fountain of water in the wilderness, by the fountain in the way [to] Shur,
chr: ᏗᎧᎿᏩᏗᏙᎯᏃ ᏱᎰᏩ ᎤᏤᎵᎦ ᎤᏩᏛᎮ ᎦᎸᎪᎬᎢ ᎢᎾᎨᎢ, ᎾᏍᎩ ᏅᏃᎱᎶᏗ ᏌᎵᏱ ᏫᎦᏅᏅ ᏥᎦᏄᎪᎦ.

source: and he saith, 'Hagar, Sarai's handmaid, whence hast thou come, and whither dost thou go?' and she saith, 'From the presence of Sarai, my mistress, I am fleeing.'
chr: ᎯᎠᏃ ᏄᏪᏎ ᎾᏍᎩ, ᎮᎦ, ᏎᎳᏱ ᏣᏅᏏᏓᏍᏗ, ᎭᏢ ᏘᎶᎯ? ᎠᎴ ᎭᏢ ᏮᏘᎶᏏ? ᎯᎠᏃ ᏄᏪᏎᎢ, ᏎᎳᏱ ᎠᎩᏅᏏᏓᏍᏗ ᏥᏯᎵᏗᎡᎭ.

source: And the messenger of Jehovah saith to her, 'Turn back unto thy mistress, and humble thyself under her hands;'
chr: ᏗᎧᎿᏩᏗᏙᎯᏃ ᏱᎰᏩ ᎤᏤᎵᎦ ᎯᎠ ᏄᏪᏎᎴᎢ, ᏥᎭᏨᎾᏉ, ᏣᏅᏏᏓᏍᏗ ᏥᏫᎯᎷᏥᏏ, ᎠᎴ ᏥᏫᏙᎯᏯᏓᏲᎯᏏᏉ.

source: and the messenger of Jehovah saith to her, 'Multiplying I multiply thy seed, and it is not numbered from multitude;'
chr: ᏗᎧᎿᏩᏗᏙᎯᏃ ᏱᎰᏩ ᎤᏤᎵᎦ ᎯᎠ ᏄᏪᏎᎴᎢ, ᏂᎯ ᏣᏁᏢᏔᏅᎯ ᎨᏒ ᎤᏣᏔᏅᎯ ᏓᎦᏥᎪᏙᎯᏍᏔᏂ, ᎾᏍᎩ ᎥᏝ ᏰᎵ ᏗᎬᏎᎰᎲᏍᏗ ᏱᎨᏎᏍᏗ ᏄᏂᏧᏈᏍᏕᏍᏗ.

source: and the messenger of Jehovah saith to her, 'Behold thou [art] conceiving, and bearing a son, and hast called his name Ishmael, for Jehovah hath hearkened unto thine affliction;
chr: ᏗᎧᎿᏩᏗᏙᎯᏃ ᏱᎰᏩ ᎤᏤᎵᎦ, ᎯᎠ ᏄᏪᏎᎴᎢ, ᎬᏂᏳᏉ, ᎯᏁᎵᏛ, ᎠᎴ ᎠᏧᏣ ᏘᎾᏄᎪᏫᏏ, ᎠᎴ ᎢᏏᎺᎵ ᏙᏘᏲᎢ; ᏅᏗᎦᎵᏍᏙᏗᎭ ᏱᎰᏩ ᏣᏛᎦᏁᎸ ᎤᏪᎵᎯᏍᏗ ᏂᏣᎵᏍᏓᏁᎲᎢ.

source: and he is a wild-ass man, his hand against every one, and every one's hand against him -- and before the face of all his brethren he dwelleth.'
chr: ᎠᎴ ᏗᎦᎵᎠᏅᎯᏛ ᎬᏘᏌᏘ ᎾᏍᎩᏯ ᎨᏎᏍᏗ ᎠᏍᎦᏯ; ᎾᏂᎥ ᏴᏫ ᏗᎦᏘᎴᎩ, ᎠᎴ ᎾᏂᎥ ᏴᏫ ᏗᎬᏩᎦᏘᎴᎩ ᎨᏎᏍᏗ; ᎠᎴ ᏂᎦᏛ ᎠᎾᎵᏅᏟ ᏄᎾᏛᏅ ᎾᎥ ᎡᎮᏍᏗ.

source: And she calleth the name of Jehovah who is speaking unto her, 'Thou [art], O God, my beholder;' for she said, 'Even here have I looked behind my beholder?'
chr: ᎠᎴ ᎯᎠ ᏄᏍᏕ ᏚᏬᎡ ᏱᎰᏩ ᎾᏍᎩ ᎤᏬᏁᏔᏅᎯ, ᏂᎯ ᏣᏁᎳᏅᎯ ᏍᎩᎪᏩᏘᏍᎩ; ᎯᎠᏰᏃ ᏄᏪᏎᎢ, ᏥᎪ ᎾᏍᏉ ᎠᏴ ᎠᏂ ᏕᏥᏯᎦᏅᎦ ᎠᎩᎪᏩᏘᏍᎩ.

source: therefore hath one called the well, 'The well of the Living One, my beholder;' lo, between Kadesh and Bered.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ, ᎾᏍᎩ ᎠᎹ ᎦᏁᎲᎢ ᎠᏔᎴᏒ ᎳᎭᎢᎶᎢ ᏚᏃᎡᎢ; ᎬᏂᏳᏉ, ᎾᏍᎩ ᎨᏕᏏ ᏇᎴᏗᏃ ᎠᏰᎵ ᎠᎹ ᏥᎦᏁᎭ.

source: And Hagar beareth to Abram a son; and Abram calleth the name of his son, whom Hagar hath borne, Ishmael;
chr: ᎮᎦᏃ ᎤᎾᏄᎪᏫᏎᎴ ᎡᏆᎻ ᎠᏧᏣ; ᎡᏆᎻᏃ ᎤᏪᏥ ᎾᏍᎩ ᎮᎦ ᏧᎾᏄᎪᏫᏎᎴ ᎢᏏᎺᎵ ᏚᏬᎡᎢ.

source: and Abram [is] a son of eighty and six years in Hagar's bearing Ishmael to Abram.
chr: ᎡᏆᎻᏃ ᏁᎳᏍᎪᎯ ᏑᏓᎵᎦᎵ ᎢᏳᏕᏘᏴᏛ ᎨᏎᎢ, ᎾᎯᏳ ᎮᎦ ᎢᏏᎺᎵ ᏧᎾᏄᎪᏫᏎᎴ ᎡᏆᎻ.

source: Chapter 17
chr: ᎠᏯᏙᎸᎢ 17

source: And Abram is a son of ninety and nine years, and Jehovah appeareth unto Abram, and saith unto him, 'I [am] God Almighty, walk habitually before Me, and be thou perfect;
chr: ᎡᏆᎻᏃ ᏐᎣᏁᎳᏍᎪᎯ ᏐᎣᏁᎳᎦᎵ ᎢᏳᏕᏘᏴᏛ ᎨᏎᎢ, ᏱᎰᏩ ᎬᏂᎨᏒ ᏄᏛᏁᎴ ᎡᏆᎻ, ᎠᎴ ᎯᎠ ᏄᏪᏎᎴᎢ, ᎠᏴ ᏫᎾᏍᏛᎾ ᎠᏆᎵᏂᎩᏗᏳ ᎠᏆᏁᎳᏅᎯ; ᎠᏴ ᏥᎦᏔᎲ ᎭᎴᏂᏙᎮᏍᏗ, ᎠᎴ ᏂᏍᎦᏅᎾ ᎨᏎᏍᏗ.

source: and I give My covenant between Me and thee, and multiply thee very exceedingly.'
chr: ᎠᎴ ᎧᏃᎮᏛ ᏙᏓᎬᏯᏠᎢᏍᏓᏁᎵ, ᎠᎴ ᎤᏣᏔᏅᎯ ᏓᎬᎪᏙᎯᏍᏔᏂ.

source: And Abram falleth upon his face, and God speaketh with him, saying,
chr: ᎡᏆᎻᏃ ᎤᏯᏍᏚᏎᎢ; ᎤᏁᎳᏅᎯᏃ ᎤᎵᏃᎮᏔᏁᎢ, ᎯᎠ ᏄᏪᏎᎢ,

source: 'I -- lo, My covenant [is] with thee, and thou hast become father of a multitude of nations;
chr: ᎠᏴᏍᎩᏂ ᎨᏒᎢ, ᎬᏂᏳᏉ ᎧᏃᎮᏛ ᏕᎬᏯᏠᎢᏍᏓᏁᎸ, ᏂᎯᏃ ᎤᏂᏣᏘ ᎤᎾᏓᏤᎵᏛ ᏴᏫ ᏘᎦᏴᎵᎨ ᎢᏣᎵᏍᏙᏗ ᎨᏎᏍᏗ.

source: and thy name is no more called Abram, but thy name hath been Abraham, for father of a multitude of nations have I made thee;
chr: ᎥᏝ ᎠᎴ ᎿᏉ ᎡᏆᎻ ᏰᏦᏎᎮᏍᏗ, ᎡᏆᎭᎻᏍᎩᏂ ᏕᎶᏙᎡᏍᏗ; ᎤᏂᏣᏘᏰᏃ ᎤᎾᏓᏤᎵᏛ ᏴᏫ ᏘᎦᏴᎵᎨ ᏂᎬᏴᎦ.

source: and I have made thee exceeding fruitful, and made thee become nations, and kings go out from thee.
chr: ᎠᎴ ᎤᏣᏔᏅᎯ ᏣᏁᏉᏣᏘ ᏅᏓᎬᏴᏁᎵ, ᏂᎯᏃ ᎨᏒ ᎤᎾᏓᏤᎵᏛ ᏴᏫ ᏓᎦᏥᏲᏢᏂ, ᎠᎴ ᏂᎯ ᎨᏒ ᎤᏂᎬᏫᏳᎯ ᏅᏓᏳᎾᏓᎴᏗ ᎨᏎᏍᏗ.

source: 'And I have established My covenant between Me and thee, and thy seed after thee, to their generations, for a covenant age-during, to become God to thee, and to thy seed after thee;
chr: ᎠᎴ ᏓᏥᏍᏓᏱᏗ ᎧᏃᎮᏛ ᏕᎬᏯᏠᎢᏍᏓᏁᎸᎢ, ᏂᎯ, ᎠᎴ ᏂᎯ ᏣᏁᏢᏔᏅᎯ ᎣᏂ ᎤᏅᏓᏗᏗᏒᎢ, ᎾᏍᎩ ᎠᎾᏁᏢᏔᏂᏒᎢ, ᎾᏍᎩ ᏭᏍᏗᏥᎯᏍᏗ ᏂᎨᏒᎾ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛᎢ, ᎾᏍᎩ ᎠᏴ ᎬᏯᏁᎳᏅᎯ ᎨᏒᎢ, ᎠᎴ ᎾᏍᎩ ᏂᎯ ᏣᏁᎵᏔᏅᎯ ᎣᏂ ᎤᏅᎫᏗᏗᏒᎢ.

source: and I have given to thee, and to thy seed after thee, the land of thy sojournings, the whole land of Canaan, for a possession age-during, and I have become their God.'
chr: ᎠᎴ ᏂᎯ ᏓᎬᏁᎵ ᎠᎴ ᏂᎯ ᏣᏁᏢᏔᏅᎯ ᎣᏂ ᎤᏅᏓᏗᏗᏒ ᎯᎠ ᎾᏍᎩ ᎦᏙᎯ ᎾᎿ ᎮᏙᎯ ᏥᎩ, ᎾᏍᎩ ᏂᎬᎾᏛ ᎨᎾᏂ ᎦᏓ ᎠᎲᎢ, ᏭᏍᏗᏥᎯᏍᏗ ᏂᎨᏒᎾ ᎤᎾᏤᎵᎦ ᎢᏳᎵᏍᏙᏗᏱ; ᎠᏴᏃ ᎦᏥᏯᏁᎳᏅᎯ ᎨᏎᏍᏗ.

source: And God saith unto Abraham, 'And thou dost keep My covenant, thou and thy seed after thee, to their generations;
chr: ᎤᏁᎳᏅᎯᏃ ᎯᎠ ᏄᏪᏎᎴ ᎡᏆᎭᎻ, ᎾᏍᎩᏃ ᎢᏳᏍᏗ ᏂᎯ ᏣᏍᏆᏂᎪᏙᏗ ᎨᏎᏍᏗ ᏆᏤᎵ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛᎢ, ᏂᎯ ᎠᎴ ᏣᏁᏢᏔᏅᎯ ᎣᏂ ᎤᏅᏓᏗᏗᏒ ᎠᎾᏁᏢᏔᏂᏒᎢ.

source: this [is] My covenant which ye keep between Me and you, and thy seed after thee: Every male of you [is] to be circumcised;
chr: ᎯᎠ ᎾᏍᎩ ᏄᏍᏗ ᎧᏃᎮᏛ ᏓᏆᏠᎯᏍᏛᎢ, ᎾᏍᎩ ᎢᏥᏍᏆᏂᎪᏙᏗ ᏥᎩ, ᏥᏕᏓᎦᏠᎯᏍᏓ, ᎠᏴ ᎠᎴ ᏂᎯ ᎠᎴ ᏂᎯ ᏣᏁᏢᏔᏅᎯ ᎣᏂ ᎤᏅᏓᏗᏗᏒᎢ; ᎾᏂᎥ ᎠᏂᏍᎦᏯ ᏕᏤᎲᎢ ᏗᎱᏍᏕᏎᏗ ᎨᏎᏍᏗ.

source: and ye have circumcised the flesh of your foreskin, and it hath become a token of a covenant between Me and you.
chr: ᎠᎴ ᏕᏥᎱᏍᏕᏍᎨᏍᏗ ᎢᏥᏇᏓᎸ ᎢᏥᏁᎪᎢ; ᎧᏃᎮᏛᏃ ᏕᎦᏠᎯᏍᏛ ᎤᏰᎸᏕᏍᏗ ᎾᏍᎩ.

source: 'And a son of eight days is circumcised by you; every male to your generations, born in the house, or bought with money from any son of a stranger, who is not of thy seed;
chr: ᎾᏍᎩᏃ ᏧᏁᎳ ᏧᏒᎯᏛ ᎦᏰᎯ ᎠᏥᎤᏍᏕᏎᏗ ᎨᏎᏍᏗ, ᎾᏂᎥ ᎠᏂᏧᏣ ᎾᏍᎩ ᏂᎯ ᎢᏣᏁᏢᏔᏅᏒᎢ, ᎾᏍᎩ ᎠᏓᏁᎸ ᎤᏕᏅᎯ, ᎠᎴ ᎠᏕᎸ ᎠᏥᏩᎯᏍᏔᏅᎯ, ᎾᏍᎩ ᎩᎶ ᏅᏩᏓᎴ ᏴᏫ ᏣᏁᏢᏔᏅᎯ ᏂᎨᏒᎾ ᎠᏥᏩᏎᎸᎯ.

source: he is certainly circumcised who [is] born in thine house, or bought with thy money; and My covenant hath become in your flesh a covenant age-during;
chr: ᎯᏁᎸ ᎤᏕᏅᎯ, ᎠᎴ ᏣᏤᎵ ᎠᏕᎸ ᎯᏩᎯᏍᏔᏅᎯ, ᎾᏍᎩ ᎠᏎ ᎠᏥᎤᏍᏕᏎᏗ ᎨᏎᏍᏗ; ᎠᎴ ᎠᏆᏤᎵ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛ ᎢᏥᏇᏓᎸ ᎤᏰᎸᏕᏍᏗ, ᎾᏍᎩ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛ ᎤᏍᏗᏥᎯᏍᏗ ᏂᎨᏒᎾ ᎨᏒᎢ.

source: and an uncircumcised one, a male, the flesh of whose foreskin is not circumcised, even that person hath been cut off from his people; My covenant he hath broken.'
chr: ᎾᏥᎤᏍᏕᏎᎸᎾᏃ ᎠᏍᎦᏯ ᎾᏍᎩ ᎤᏇᏓᎸ ᎤᏁᎪᎯ ᎠᏥᎤᏍᏕᏎᎸᎯ ᏂᎨᏒᎾ ᎢᎨᏎᏍᏗ, ᎾᏍᎩ ᏴᏫ ᎠᏥᎢᏍᏗ ᎨᏎᏍᏗ ᎤᏠᏱ ᎤᏙᏣᎸᎢ; ᎤᏲᏍᏔᏅᎯᏰᏃ ᎨᏎᏍᏗ ᎧᏃᎮᏛ ᏓᏆᏠᎯᏍᏛᎢ.

source: And God saith unto Abraham, 'Sarai thy wife -- thou dost not call her name Sarai, for Sarah [is] her name;
chr: ᎤᏁᎳᏅᎯᏃ ᎯᎠ ᏄᏪᏎᎴ ᎡᏆᎭᎻ, ᎯᎠᏃ ᏎᎳᏱ ᏣᏓᎵᎢ; ᎥᏝ ᏎᎳᏱ ᏱᏲᏎᎮᏍᏗ, ᏎᎵᏰᏃ ᏚᏙᎥ.

source: and I have blessed her, and have also given to thee a son from her; and I have blessed her, and she hath become nations -- kings of peoples are from her.'
chr: ᎠᎴ ᎣᏍᏛ ᏅᏓᏥᏯᏛᏁᎵ, ᎠᎴ ᏓᎬᏯᎧᏁᎵ ᎠᏧᏣ ᎾᏍᎩ ᏓᏣᎾᏄᎪᏫᏎᎵ; ᎥᎥ, ᎣᏍᏛ ᏅᏓᏥᏯᏛᏁᎵ ᎠᎴ ᎾᏍᎩ ᎨᏒ ᏗᎾᏓᎴᎲᏍᎨᏍᏗ ᎤᎾᏓᏤᎵᏛ ᏴᏫ; ᎤᏂᎬᏫᏳᎯ ᎤᎾᏓᏤᎵᏛ ᏴᏫ ᏧᎾᏤᎵᎦ ᏙᏓᎦᎾᏄᎪᏫᏏ.

source: And Abraham falleth upon his face, and laugheth, and saith in his heart, 'To the son of an hundred years is one born? or doth Sarah -- daughter of ninety years -- bear?'
chr: ᎿᏉᏃ ᎡᏆᎭᎻ ᎤᏯᏍᏚᏎᎢ, ᎠᎴ ᎤᏰᏤᎢ, ᎠᎴ ᎯᎠ ᏄᏪᏎ ᏧᏓᏅᏛᎢ, ᏥᎪ ᎤᏪᏥ ᏛᎤᏕᏁᎵ ᎾᏍᎩ ᎠᏍᎪᎯᏧᏈ ᎢᏳᏕᏘᏴᏛ ᎿᏉ ᏥᎩ; ᎠᎴ ᏎᎵ ᏐᎣᏁᎳᏍᎪᎯ ᎢᏳᏕᏘᏴᏛ ᏥᎩ ᏙᏛᎠᎷᎸᏂᏍᎪ?

source: And Abraham saith unto God, 'O that Ishmael may live before Thee;'
chr: ᎡᏆᎭᎻᏃ ᎯᎠ ᏄᏪᏎᎴ ᎤᏁᎳᏅᎯ, ᎢᏏᎺᎵ ᎯᎦᏔᎲ ᏩᎴᏂᏓ!

source: and God saith, 'Sarah thy wife is certainly bearing a son to thee, and thou hast called his name Isaac, and I have established My covenant with him, for a covenant age-during, to his seed after him.
chr: ᎤᏁᎳᏅᎯᏃ ᎯᎠ ᏄᏪᏎᎢ, ᎤᏙᎯᏳᎯᏍᎩᏂ ᏎᎵ ᏣᏓᎵᎢ ᏓᎦᎾᏄᎪᏫᏏ ᏤᏥ ᎠᏧᏣ; ᎠᎴ ᎡᏏᎩ ᏙᏘᏲᎢ; ᎠᎴ ᎾᏍᎩ ᏓᏥᏍᏓᏱᏕᎵ ᎠᏆᏤᎵ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛᎢ, ᎾᏍᎩ ᎤᏍᏗᏥᎯᏍᏗ ᏂᎨᏒᎾ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛᎢ, ᎠᎴ ᏓᎦᏥᏍᏓᏱᏕᎵ ᎾᏍᎩ ᎤᏁᏢᏔᏅᎯ ᎣᏂ ᎤᏅᎫᏗᏗᏒᎢ.

source: As to Ishmael, I have heard thee; lo, I have blessed him, and made him fruitful, and multiplied him, very exceedingly; twelve princes doth he beget, and I have made him become a great nation;
chr: ᎢᏏᎺᎵᏃ ᎯᏁᎢᏍᏗᏍᎬ ᎬᏯᏛᎦᏁᎸ; ᎬᏂᏳᏉ, ᎣᏍᏛ ᏂᏥᏯᏛᏂᏏ, ᎠᎴ ᎤᏁᏉᏣᏘᏳ ᏅᏓᏥᏴᏁᎵ, ᎠᎴ ᎤᏣᏔᏅᎯ ᏓᏥᎪᏙᎯᏍᏔᏂ; ᏔᎳᏚᎢᏯᏂᏛ ᎤᏂᎬᏫᏳᎯ ᏓᎬᏩᏕᏁᎵ, ᎠᎴ ᎾᏍᎩ ᎤᏁᏢᏔᏅᏛ ᎤᏂᏧᏈᏍᏗ ᏴᏫ ᏅᏓᎦᏥᏴᏁᎵ.

source: and My covenant I establish with Isaac, whom Sarah doth bear to thee at this appointed time in the next year;'
chr: ᎧᏃᎮᏛᏍᎩᏂ ᎠᏆᏤᎵ ᏓᏠᎯᏍᏛ ᏓᏥᏍᏓᏱᏕᎵ ᎡᏏᎩ, ᎾᏍᎩ ᏎᎵ ᏨᏓᏣᎾᏄᎪᏫᏎᎵ, ᎪᎯᏳᎳ ᎡᏘ ᎨᏎᏍᏗ.

source: and He finisheth speaking with him, and God goeth up from Abraham.
chr: ᎠᎴ ᎿᏉ ᎤᏲᎯᏍᏔᏁ ᎠᎵᏃᎮᏗᏍᎬᎢ, ᎠᎴ ᎤᏁᎳᏅᎯ ᎤᎵᏌᎳᏓᏁ ᎤᏓᏅᎡᎴ ᎡᏆᎭᎻ.

source: And Abraham taketh Ishmael his son, and all those born in his house, and all those bought with his money -- every male among the men of Abraham's house -- and circumciseth the flesh of their foreskin, in this self-same day, as God hath spoken with him.
chr: ᎡᏆᎭᎻᏃ ᏭᏯᏅᎮ ᎤᏪᏥ ᎢᏏᎺᎵ, ᎠᎴ ᏂᎦᏛ ᎦᏁᎸ ᎤᎾᏕᏅᎯ, ᎠᎴ ᏂᎦᏛ ᎠᏕᎸ ᏧᏩᎯᏍᏔᏅᎯ, ᎾᏂᎥ ᎠᏂᏍᎦᏯ ᎤᎾᏓᏑᏴ ᎡᏆᎭᎻ ᎦᏁᎸ ᎠᏁᎯ; ᎾᏍᎩᏃ ᏚᎱᏍᏕᏎᎴ ᎤᏂᏇᏓᎸ ᎤᏂᏁᎪᎢ, ᎾᎯᏳᏉ ᎢᎦ, ᎾᏍᎩᏯ ᎤᏁᎳᏅᎯ ᏄᏪᏎᎸᎢ.

source: And Abraham [is] a son of ninety and nine years in the flesh of his foreskin being circumcised;
chr: ᎡᏆᎭᎻᏃ ᏐᎣᏁᎳᏍᎪᎯ ᏐᎣᏁᎳᎦᎵ ᎢᏳᏕᏘᏴᏛ ᎨᏎᎢ, ᎾᎯᏳ ᎤᏇᏓᎸ ᎤᏁᎪᎢ ᎠᏥᎤᏍᏕᏎᎸ.

source: and Ishmael his son [is] a son of thirteen years in the flesh of his foreskin being circumcised;
chr: ᎤᏪᏥᏃ ᎢᏏᎺᎵ ᏦᎢᎦᏚ ᎢᏳᏕᏘᏴᏛ ᎨᏎᎢ, ᎾᎯᏳ ᎤᏇᏓᎸ ᎤᏁᎪᎢ ᎠᏥᎤᏍᏕᏎᎸ.

source: in this self-same day hath Abraham been circumcised, and Ishmael his son;
chr: ᎾᎯᏳᏉ ᎢᎦ ᎡᏆᎭᎻ ᎠᏥᎤᏍᏕᏎᎴᎢ, ᎠᎴ ᎾᏍᏉ ᎤᏪᏥ ᎢᏏᎺᎵ.

source: and all the men of his house -- born in the house, and bought with money from the son of a stranger -- have been circumcised with him.
chr: ᎠᎴ ᏂᎦᏛ ᎠᏂᏍᎦᏯ ᎦᏁᎸ ᎠᏁᎯ, ᎦᏁᎸ ᎤᎾᏕᏅᎯ, ᎠᎴ ᎠᏕᎸ ᎨᏥᏩᎯᏍᏔᏅᎯ, ᏅᏩᎾᏓᎴ ᏴᏫ ᎨᏥᏩᎯᏎᎸᎯ, ᎢᏧᎳᎭ ᏙᎨᏥᎤᏍᏕᏎᎴᎢ.

source: Chapter 18
chr: ᎠᏯᏙᎸᎢ 18

source: And Jehovah appeareth unto him among the oaks of Mamre, and he is sitting at the opening of the tent, about the heat of the day;
chr: ᏱᎰᏩᏃ ᎬᏂᎨᏒ ᏄᏛᏁᎴ ᎹᎺᎵ ᏧᏤᎵᎦ ᎠᏓᏯ ᏕᏡᎬᎢ; ᎦᎵᏦᏛᏃ ᎦᎶᎯᏍᏗᏱ ᎤᏬᎴ ᎢᎦ ᏧᏗᎴᎪᎢ;

source: and he lifteth up his eyes and looketh, and lo, three men standing by him, and he seeth, and runneth to meet them from the opening of the tent, and boweth himself towards the earth,
chr: ᏚᏌᎳᏓᏁᏃ ᏗᎦᏙᎵ ᎠᎴ ᏚᎧᎿᏁᎢ, ᎠᎴ ᎬᏂᏳᏉ ᎠᏂᏦᎢ ᎠᏂᏍᎦᏯ ᎤᏬᎸ ᎾᎥ ᎠᏂᏙᎾᎡᎢ; ᏚᎪᎲᏃ ᎦᎵᏦᏛ ᎦᎶᎯᏍᏗᏱ ᎤᏬᎸ ᎤᏁᎷᎩᏎ ᏫᏚᏠᏎᎢ, ᎠᎴ ᎡᎳᏗ ᏄᏛᏁᎴᎢ,

source: And he saith, 'My Lord, if, I pray thee, I have found grace in thine eyes, do not, I pray thee, pass on from thy servant;
chr: ᎠᎴ ᎯᎠ ᏄᏪᏎᎢ, ᏣᎬᏫᏳᎯ ᎠᏆᏤᎵ, ᎢᏳᏃ ᏗᏍᏆᏓᏂᎸᏨᎯ ᎨᏎᏍᏗ, ᏞᏍᏗ ᎯᎶᎢᏎᎸᎩᏉ ᎯᏅᏏᏓᏍᏗ;

source: let, I pray thee, a little water be accepted, and wash your feet, and recline under the tree;
chr: ᎦᏲᎵ ᎠᎹ ᏩᏂᏁᎩ, ᎠᎴ ᏗᏣᎳᏏᏕᏂ ᏗᏦᏑᎵ, ᎠᎴ ᎢᏣᏣᏪᏐᎸᏍᏓ ᏡᎬ ᎭᏫᏂᏗᏢ;

source: and I bring a piece of bread, and support ye your heart; afterwards pass on, for therefore have ye passed over unto your servant;' and they say, 'So mayest thou do as thou has spoken.'
chr: ᎤᏍᏗᏃ ᎠᎵᏍᏓᏴᏗ ᏮᏓᏥᎩᏏ ᏗᏣᏓᏅᏙᏃ ᏕᏥᎧᎵᏍᏓᏛᎭ; ᎩᎳᏃ ᎢᏣᏂᎩᏒᎭ; ᎾᏍᎩᏰᏃ ᎢᏳᏍᏗ ᎡᏥᎷᏤᎸ ᎡᏥᏅᏏᏓᏍᏗ. ᎯᎠᏃ ᏄᏂᏪᏎᎢ, ᏂᏣᏪᏒ ᎾᏍᎩᏯ ᎿᏛᎦ.

source: And Abraham hasteth towards the tent, unto Sarah, and saith, 'Hasten three measures of flour-meal, knead, and make cakes;'
chr: ᎡᏆᎭᎻᏃ ᎤᎵᏍᏗ ᎦᎵᏦᏛ ᏭᏴᎴ ᏎᎵ ᏧᏬᎸᎢ, ᎯᎠᏃ ᏫᏄᏪᏎᎢ, ᏄᎳ ᎭᏛᏅᎢᏍᏓ ᏦᎢ ᎢᏯᏟᎶᎥᎯ ᏩᎾᎨ ᎢᏒ; ᎭᏑᎬᎵ, ᎠᎴ ᏘᏃᏢᏛᎦ.

source: and Abraham ran unto the herd, and taketh a son of the herd, tender and good, and giveth unto the young man, and he hasteth to prepare it;
chr: ᎡᏆᎭᎻᏃ ᏩᎦ ᏗᏁᏙᎲ ᏭᏗᏢᏍᏔᏁᎢ, ᎠᎴ ᎤᏘᏃᎴ ᏩᎦ ᎠᎩᎾ ᎤᏓᎨᎢ ᎠᎴ ᎣᏍᏛ, ᎠᎴ ᎠᏫᏅ ᎤᏪᎧᏁᎴᎢ; ᎾᏍᎩᏃ ᎤᎵᏍᏗ ᎣᏍᏛ ᏄᏩᏁᎴᎢ.

source: and he taketh butter and milk, and the son of the herd which he hath prepared, and setteth before them; and he is standing by them under the tree, and they do eat.
chr: ᎡᏆᎭᎻᏃ ᎪᎢ-ᎪᏢᏅᎯ ᏭᎩᏎᎢ, ᎠᎴ ᎤᏅᏗ ᏭᏁᎩᏎᎢ, ᎠᎴ ᏩᎦ ᎠᎩᎾ ᎾᏍᎩ ᎣᏍᏛ ᎢᏳᏩᏁᎸᎯ ᏭᏁᏎᎢ, ᎠᎴ ᏚᏪᎳᏍᏔᏁᎢ; ᎠᏂᏅᏃ ᎤᎶᏗᏢ ᎤᎴᏁ ᏡᎬ ᎭᏫᏂᏗᏢ, ᎠᎴ ᎤᎾᎵᏍᏓᏴᏁᎢ.

source: And they say unto him, 'Where [is] Sarah thy wife?' and he saith, 'Lo -- in the tent;'
chr: ᎯᎠᏃ ᏂᎬᏩᏪᏎᎴᎢ, ᎭᏢ ᏎᎵ ᏣᏓᎵᎢ? ᎯᎠᏃ ᏄᏪᏎᎢ, ᎬᏂᏳᏉ, ᎠᏂ ᎦᎵᏦᏛᎢ.

source: and he saith, 'returning I return unto thee, about the time of life, and lo, to Sarah thy wife a son.'
chr: ᎯᎠᏃ ᏄᏪᏎ ᎾᏍᎩ, ᎤᏙᎯᏳᎯᏯ ᏛᎬᏩᏛᎯᎵ ᎾᎯᏳ ᏓᏁᎶᏛ ᎠᏲᎵ ᎤᏕᏗᏱ; ᎠᎴ ᎬᏂᏳᏉ, ᏎᎵ ᏣᏓᎵᎢ ᏓᎦᎾᏄᎪᏫᏏ ᎠᏧᏣ. ᏎᎵᏃ ᏧᏛᎦᏁ ᎦᎵᏦᏛ ᎦᎶᎯᏍᏗᏱ ᎤᏬᎸᎢ ᎾᏍᎩ ᎤᏐᎭᏛ ᎢᏗᏢ ᏥᎨᏎᎢ.

source: And Sarah is hearkening at the opening of the tent, which is behind him;
chr: ᎡᏆᎭᎻᏃ ᎠᎴ ᏎᎵ ᎠᏂᎦᏴᎵᎨ ᎠᎴ ᏧᎾᏕᏘᏱᎶᏛ ᎨᏎᎢ; ᏎᎵᏃ ᎤᎶᎯᏎᎸᎯ ᎨᏎ ᎠᏂᎨᏴ ᎢᏳᎾᎵᏍᏓᏁᏗ ᎨᏒᎢ.

source: and Abraham and Sarah [are] aged, entering into days -- the way of women hath ceased to be to Sarah;
chr: ᏎᎵᏃ ᏧᏓᏅᏛ ᎤᏰᏤᎢ, ᎯᎠ ᏄᏪᏎᎢ. ᏥᎪ ᎿᏉ ᎠᎩᎦᏴᎳᏨᎯ ᏥᎩ ᎣᏍᏛ ᏛᎦᏓᏅᏓᏗ, ᎠᎴ ᎾᏍᏉ ᏗᏥᏯᏁᎶᏗ ᎤᏛᏐᏅᎯ ᏥᎩ?

source: and Sarah laugheth in her heart, saying, 'After I have waxed old I have had pleasure! -- my lord also [is] old!'
chr: ᏱᎰᏩᏃ ᎯᎠ ᏄᏪᏎᎴ ᎡᏆᎭᎻ, ᎦᏙᏃ ᏎᎵ ᎾᏍᎩ ᎯᎠ ᏧᏰᏨ, ᎯᎠ ᏥᏂᎦᏫ, ᏥᎪ ᎤᏙᎯᏨᎯ ᎠᏲᎵ ᏛᏥᎾᏄᎪᏫᏏ ᎿᏉ ᏥᎦᏴᎵᎨ ᏥᎩ?

source: And Jehovah saith unto Abraham, 'Why [is] this? Sarah hath laughed, saying, Is it true really -- I bear -- and I am aged? Is any thing too wonderful for Jehovah? at the appointed time I return unto thee, about the time of life, and Sarah hath a son.'
chr: ᏥᎪ ᏱᎰᏩ ᎪᎱᏍᏗ ᎬᏩᏄᎸᏗ? ᎾᎯᏳ ᎠᏎᎯᏛ ᎨᏒ ᏛᎬᎷᏤᎵ, ᏓᏁᎶᏛ ᎠᏲᎵ ᎤᏕᏘᏱ, ᎠᎴ ᏎᎵ ᎠᏧᏣ ᏓᎦᎾᏄᎪᏫᏏ.
